{
  "frames": {
    "tablet-warning": {
      "blocks": [
        {
          "emph": true,
          "text": "Many parts of this study are designed to only respond to touchscreen input (not mouse clicks), The study enforces a minimum screen size so it is not compatible with phones. If you're currently signed in on a computer or a phone, please sign in to CHS on a tablet device and continue from there instead.",
          "title": "This study only works on tablets!"
        }
      ],
      "showPreviousButton": false,
      "kind": "exp-lookit-text"
    },
    "video-config": {
      "kind": "exp-video-config",
      "troubleshootingIntro": "If you're having any trouble getting your webcam set up, please feel free to email Nicole Coates at nhcoates@mit.edu and we'd be glad to help you out!"
    },
    "video-consent": {
      "kind": "exp-lookit-video-consent",
      "template": "consent_005",
      "PIName": "Laura Schulz",
      "institution": "Massachusetts Institute of Technology",
      "PIContact": "the ECCL lab at nhcoates@mit.edu",
      "purpose": "Young children rarely get introduced to sets (beyond counting their elements), functions, or data visualization, and when young children are introduced to graphical representations at all, they are usually asked to report information explicitly encoded in the graph (e.g., 'Which child sold the most cookies?') rather than to find relationships in the data or extrapolate beyond the data. Here, we are interested if young children can extrapolate beyond the data by guessing what the data might look like next and if children can make predictions about why the data in the graph looks the way it does.",
      "procedures": "After seeing instructions on Children Helping Science, your child will complete questions about graphs by using their finger to make predictions about how the graph will look next or by verbally responding to questions.",
      "risk_statement": "There are no expected risks if you participate in the study.",
      "payment": "After you finish the study, we will email you a $5 Amazon gift card (via a code that can be entered online) within five days to thank you for your time. To be eligible for the gift card your child must be in the age range for this study, you need to submit a valid consent statement, and we need to see that there is a child with you. But we will send a gift card even if you do not finish the whole study or we are not able to use your child's data! There are no other direct benefits to you or your child from participating, but we hope you will enjoy the experience.",
      "include_databrary": true,
      "research_rights_statement": "You are not waiving any legal claims, rights or remedies because of your participation in this research study.  If you feel you have been treated unfairly, or you have questions regarding your rights as a research subject, you may contact the Committee On the Use of Humans as Experimental Subjects (COUHES), Massachusetts of Technology, 77 Massachusetts Avenue Cambridge, MA 02139 (contact: couhes@mit.edu)"
    },
    "instructions": {
      "kind": "exp-lookit-instructions",
      "blocks": [
        {
          "text": "Please try playing this sample audio to make sure you'll be able to hear the story.",
          "title": "Adjust your speakers",
          "mediaBlock": {
            "text": "You should hear 'Ready to go?'",
            "isVideo": false,
            "sources": [
              {
                "src": "https://s3.amazonaws.com/lookitcontents/exp-physics-final/audio/ready.mp3",
                "type": "audio/mp3"
              },
              {
                "src": "https://s3.amazonaws.com/lookitcontents/exp-physics-final/audio/ready.ogg",
                "type": "audio/ogg"
              }
            ],
            "mustPlay": true,
            "warningText": "Please try playing the sample audio."
          }
        }
      ],
      "showWebcam": true,
      "webcamBlocks": [
        {
          "title": "Make sure we can see you",
          "listblocks": [
            {
              "text": "Take a look at your webcam view above. Get comfy, and adjust your own position or the computer as needed so both you and your child are visible."
            },
            {
              "text": "This isn't a Skype call - no one in the lab can see you - but the recorded video of your participation will be sent to the lab to help with data analysis. It's helpful for us to be able to see if your child was pointing or looking confused, for example."
            }
          ]
        }
      ],
      "nextButtonText": "Next"
    },
    "start-recording": {
      "kind": "exp-lookit-start-recording",
      "baseDir": "https://vivhan.scripts.mit.edu/graphing_scaffold/img",
      "image": "0_intro.png",
      "imageAnimation": "bounce",
      "displayFullscreen": true
    },
    "embedded-survey": {
      "kind": "exp-lookit-iframe",
      "iframeHeight": "600px",
      "iframeWidth": "100%",
      "instructionText": "Please complete the survey above. When finished, click the green 'Next' button to continue with the experiment.",
      "optionalExternalLink": true,
      "generateProperties": "function(expData, sequence, child, pastSessions, conditions) { return { 'iframeSrc': `https://vivhan.scripts.mit.edu/graphing_scaffold/?c=${child.get('id')}&r=${pastSessions.filter((session)=>session.get('completedConsentFrame')).length}` }; }"
    },
    "stop-recording": {
      "kind": "exp-lookit-stop-recording",
      "baseDir": "https://vivhan.scripts.mit.edu/graphing_scaffold/img",
      "image": "0_intro.png",
      "imageAnimation": "bounce",
      "displayFullscreen": true
    },
    "exit-survey": {
      "kind": "exp-lookit-exit-survey",
      "debriefing": {
        "blocks": [
          {
            "text": "Thank you for participating in this study!"
          },
          {
            "text": "Thank you again for participating in this study. Developmental research would be impossible without parental support. Please note that you have the right to withdraw your data from the study if you wish. We'll be emailing you a $5 Amazon gift card. This should arrive in your inbox within the next week after we confirm that a child is with you in the video recording and check that your child is in the age range for this study. If you don't hear from us by then, feel free to reach out! Please don't hesitate to contact us at nhcoates@mit.edu if you have any additional questions or feedback!"
          }
        ]
      },
      "showDatabraryOptions": false,
      "includeWithdrawalExample": true,
      "privateLevelOnly": false
    }
  },
  "sequence": [
    "tablet-warning",
    "video-config",
    "video-consent",
    "instructions",
    "start-recording",
    "embedded-survey",
    "stop-recording",
    "exit-survey"
  ]
}